{
  "notification": {
    "title": "The title of the notification",
    "body": "The notification body",
    "imageUrl": "URL of an image to be displayed in the notification."
  },
  "data": {
    "key": "value"
  },
  "android": {
    "collapseKey": 
      " string Collapse key for the message. Collapse key serves as an identifier for a 
      group of messages that can be collapsed, so that only the last message gets
      sent when delivery can be resumed. A maximum of four different collapse keys
      ay be active at any given time",
    "priority": "('high' | 'normal') Priority of the message. Must be either `normal` or `high`",
    "ttl": " number Time-to-live duration of the message in milliseconds",
    "restrictedPackageName": 
        "string Package name of the application where the registration tokens must match
         in order to receive the message.",

    "data": {
      "__description": "A collection of data fields to be included in the message. All values must
         be strings. When provided, overrides any data fields set on the top-level
         `admin.messaging.Message`.}",
      "key": "value",
    },
    "notification": {
      "__description": "Android notification to be included in the message",
      "title": "string Title of the Android notification. When provided, overrides the title set via
        `admin.messaging.Notification`",
      "body": "string Body of the Android notification. When provided, overrides the body set via
        `admin.messaging.Notification`.",
      "icon": "string Icon resource for the Android notification.",
      "color": "string Notification icon color in `#rrggbb` format.",
      "tag": "string Notification tag. This is an identifier used to replace existing
         notifications in the notification drawer. If not specified, each request
         creates a new notification.",
      "sound": "string File name of the sound to be played when the device receives the
        notification",
      "clickAction": "string Action associated with a user click on the notification. If specified, an
         activity with a matching Intent Filter is launched when a user clicks on the
        notification.",
      "imageUrl": "string URL of an image to be displayed in the notification.",
      "bodyLockKey": "string Key of the body string in the app's string resource to use to localize the body text.",
      "bodyLockArgs": "string[] An array of resource keys that will be used in place of the format
         specifiers in `bodyLocKey`.",
      "titleLockKey": "string Key of the title string in the app's string resource to use to localize the
         title text",
      "titleLockArgs": "string[] An array of resource keys that will be used in place of the format
         specifiers in `titleLocKey",
      "channelId": "string The Android notification channel ID (new in Android O). The app must create
         a channel with this channel ID before any notification with this channel ID
         can be received. If you don't send this channel ID in the request, or if the
         channel ID provided has not yet been created by the app, FCM uses the channel
         ID specified in the app manifest.",
      "ticker": "string Sets the ticker text, which is sent to accessibility services. Prior to
         API level 21 (Lollipop), sets the text that is displayed in the status bar
         when the notification first arrives.",
      "sticky": "boolean When set to `false` or unset, the notification is automatically dismissed when
        the user clicks it in the panel. When set to `true`, the notification persists
        even when the user clicks it.",
      "eventTimestamp": "Date For notifications that inform users about events with an absolute time reference, sets
        the time that the event in the notification occurred. Notifications
        in the panel are sorted by this time.",
      "localOnly": "Boolean Sets whether or not this notification is relevant only to the current device.
         Some notifications can be bridged to other devices for remote display, such as
         a Wear OS watch. This hint can be set to recommend this notification not be bridged.
         See [Wear OS guides](https://developer.android.com/training/wearables/notifications/bridger#existing-method-of-preventing-bridging)",
      "priority": "('min' | 'low' | 'default' | 'high' | 'max') Sets the relative priority for this notification. Low-priority notifications
         may be hidden from the user in certain situations. Note this priority differs
        from `AndroidMessagePriority`. This priority is processed by the client after
        the message has been delivered. Whereas `AndroidMessagePriority` is an FCM concept
        that controls when the message is delivered.",
      "vibrateTimingsMillis": "number[]  Sets the vibration pattern to use. Pass in an array of milliseconds to
         turn the vibrator on or off. The first value indicates the duration to wait before
         turning the vibrator on. The next value indicates the duration to keep the
         vibrator on. Subsequent values alternate between duration to turn the vibrator
         off and to turn the vibrator on. If `vibrate_timings` is set and `default_vibrate_timings`
         is set to `true`, the default value is used instead of the user-specified `vibrate_timings`.",
      "defaultSound": "boolean If set to `true`, use the Android framework's default sound for the notification.
        Default values are specified in [`config.xml`](https://android.googlesource.com/platform/frameworks/base/+/master/core/res/res/values/config.xml).",
      "lightSettings": {
        "_description": " Settings to control the notification's LED blinking rate and color if LED is
         available on the device. The total blinking time is controlled by the OS.",
        "color": "string Required. Sets color of the LED in `#rrggbb` or `#rrggbbaa` format.",
        "lightOnDurationMillis": "number Required. Along with `light_off_duration`, defines the blink rate of LED flashes.",
        "lightOffDurationMillis": "number Required. Along with `light_on_duration`, defines the blink rate of LED flashes."
      },
      "defaultLightSettings": "boolean If set to `true`, use the Android framework's default LED light settings
         for the notification. Default values are specified in [`config.xml`](https://android.googlesource.com/platform/frameworks/base/+/master/core/res/res/values/config.xml).
         If `default_light_settings` is set to `true` and `light_settings` is also set,
         the user-specified `light_settings` is used instead of the default value.",
      "visibility": "('private' | 'public' | 'secret') Sets the visibility of the notification. Must be either `private`, `public`,
          or `secret`. If unspecified, defaults to `private`.",
      "notificationCount": "number  Sets the number of items this notification represents. May be displayed as a
         badge count for Launchers that support badging. See [`NotificationBadge`(https://developer.android.com/training/notify-user/badges).
         For example, this might be useful if you're using just one notification to
         represent multiple new messages but you want the count here to represent
         the number of total new messages. If zero or unspecified, systems
         that support badging use the default, which is to increment a number
         displayed on the long-press menu each time a new notification arrives."
    },
    "fcmOptions": {
      "__description": "Options for features provided by the FCM SDK for Android.",
      "analyticsLabel": "string The label associated with the message's analytics data."
    },
  },
  "webpush": {
    "headers": {
      "key": "value"
    },
    "data": {
      "key": "value"
    },
    "notification": {
      "title": "string Title text of the notification.",
      "actions": [{
        "action": "string An action available to the user when the notification is presented",
        "icon": "Optional icon for a notification action.",
        "title": "Title of the notification action."
      }],
      "badge": "string URL of the image used to represent the notification when there is
        not enough space to display the notification itself. ",
    "body": "Body text of the notification.",
    "data": "any Arbitrary data that you want associated with the notification.
      This can be of any data type.",
    "dir": "'auto' | 'ltr' | 'rtl' The direction in which to display the notification. Must be one
      of `auto`, `ltr` or `rtl`.",
    "icon": "string URL to the notification icon",
    "image": "string URL of an image to be displayed in the notification.",
    "lang": "string The notification's language as a BCP 47 language tag.",
    "renotify": "boolean A boolean specifying whether the user should be notified after a
         new notification replaces an old one. Defaults to false.",
    "requireInteraction": "boolean Indicates that a notification should remain active until the user
         clicks or dismisses it, rather than closing automatically.
         Defaults to false.",
    "silent": "boolean A boolean specifying whether the notification should be silent.
         Defaults to false.",
    "tag": "string An identifying tag for the notification.",
    "timestamp": "number Timestamp of the notification. Refer to
        https://developer.mozilla.org/en-US/docs/Web/API/notification/timestamp
        for details.",
    "vibrate": "number | number[]"

    },
    "fcmOptions": {
      "analyticsLabel": "string The label associated with the message's analytics data."
    }
  }
}
